{
    "2020_Nov_Pre": [
        "I am hoping so much that they merge iPadOS with MacOS.  iPad Pro is such an amazing device but having a unix based file system and more open access would be incredible.",
        "I want a foldable iPhone, given it's done right.",
        "If the newMacBooks don’t get a new design don’t buy it. The design is 5+ years at this point and is severely flawed and outdated.",
        "Cause this is literally history in the making. Unprecedented for the tech world.",
        "So they plan to disrupt the laptop industry with a fat-bezels notebook that looks dated half a decade? Even Razer **gaming** notebooks look better and thinner than a MPB 13\" today. Imagine that.",
        "Where did this start?",
        "Because Apple doesn't want people to buy something online today, and then return it tomorrow.   It's a waste of time & money (credit card fees).",
        "Nah, Apple has never had 2 iPhone announcements 1 month apart from each other.",
        "This year or this fiscal year? Their fiscal year just ended.",
        "Ever see the iPhone 2G launch?   So no, historically Apple has raised prices.  ^(Note: for a portion of the iPhone's life, it was partially subsidized by carriers as part of the two-year contracts.)"
    ],
    "2019_Mar_Pre": [
        "Hopefully a new MacBook Pro with a keyboard that fucking works? Maybe also doesn’t have a thin flex cable on the hinge? Oooh, maybe an iPad that doesn’t bend! Maybe if we’re lucky even a half decent VESA mount for the $5-13k iMac Pro!   Eh, that’s too much. I’ll just settle for a $200 wireless charging pad.   Edit: I guess we downvote when someone “attacks” our precious trillion dollar company? Even though the “attack” is more like “fix this because it’s broken”? I’ll never understand why you guys would prefer to defend them over broken shit than force them to fix it. ",
        "[gelöscht]",
        "Calling the name of the service now. \"Apple Show Time\"",
        "Apple’s new GIVE US MORE MONEY BECAUSE WE DONT HAVE A NEW HIT PRODUCT AFTER IPHONE event. ",
        "#Yeet",
        "My prediction… Tim ~~Cook~~ Apple steps down.  I hope not, but I think it is incoming.  If not today, very soon.",
        "showtime shouldn't be two seperate words come on Apple",
        "As part of the new streaming service, the monthly subscription will also include access to all movies and TV shows in the iTunes library.  Surprised that hasn't been incorporated since the Music subscription…. of course rather than 9.99 per month, it will be like 24.99 - 34.99.",
        "Yeeeeeeeet it’s gonna be good.",
        "I wonder if they’re crazy enough to add 4g to an iPod Touch. That way they can market it as super cheap and thin iPhone alternative. ",
        "   **Starting time:**  San Francisco: 10AM / New York: 1PM / London: 6PM / Berlin: 7PM / Moscow: 8PM / New Delhi: 10:30PM / Beijing: 1AM (March 26th) / Tokyo: 2AM (March 26th) / Sydney: 3AM (March 26th)  '  think it starts in Sydney at 4am correct me if im wrong    [http://wheniskeynote.com/](http://wheniskeynote.com/)  this is my source ",
        "Did it happen yet?",
        "Tv channels is quite drab. ",
        "Streaming VR ",
        "[gelöscht]",
        "Why do you want it?",
        "someone call the cops",
        "Oh, then I'm hoping it fails hard. I want to see some innovation; no more of this wait and perfect mentality. Invent and perfect at the same time.",
        "Seriously. And why is Starz even still a thing?",
        "You cant use the i-word :\\",
        "> If they’re introducing a gaming service, Apple desperately needs to introduce their own hardware controller  Why?",
        ">making Apple's hardware supply chain lean and profitable.   Going from offering the best possible product that resources can allow, to becoming another corporate cash grabbing corner cutting company. RIP Apple. It was fun while it lasted, unlikely we will get another visionary like Jobs that puts quality first. ",
        "[gelöscht]",
        "Apple Music is doing ok but they are so far behind Spotify in terms of quality it’s absurd. I can’t see people paying for a tv service with original content.",
        "[gelöscht]",
        "What? Lmao",
        "Why do you feel that since there is no info for you to go on?",
        "[gelöscht]",
        "I paid 350 Euro with no contract for the iPhone 3, directly from the Apple Store. ",
        "Who is Mr. Cook?",
        "My internet isnt good enough to stream 4k so anything i would want to watch in 4k i would have to download. ",
        "The way the market has moved in the past month, suggests there is something big in the pipeline.. bigger than some random streaming service with original content.  Just a hunch.   Having lost so many customers to rival platforms and tech over outpricing their own customers, they need something utterly dominant to sway back their old users… and a Netflix/Amazon Prime video, won't do that.  Anything less than full access to the iTunes video library, shares will tumble about 20-30 dollars by tomorrow.  People aren't buying their tech in the droves they were, realising that an update to a phone isn't worth shelling out 1k every year or so.  Why would people ditch their sole subscription service for an Apple one.. that no one knows will be successful or not, unless, they have access to all their favourite movies etc as a bonus to subscribe.  All these data centres weren't just for personal iCloud storage.  "
    ],
    "2018_Sept_Pre": [
        "Any final naming guesses? IMO absolutely no way they go with XS Max. I think it will be:  5.8: Iphone Xs/2019 iPhone 6.5: iPhone Xs Plus/2019 iPhone Plus 6.1: iPhone Xc/iPhone C  (either they will all be names on the left, or names on the right.)",
        "Gather Round everyone so we can hit your wallet again. We have decided to move a mic around and call it a new design and charge $1,000 🙃",
        "Maybe we're gonna see a circular apple watch?",
        "Wait. So the 5.8 OLED is called Xc?",
        "I hope they bring back the headphone jack but put it on the side of the phone",
        "[gelöscht]",
        "Sorry to disappoint you ",
        "my welcome? no, your welcome. All of our welcome!",
        ">Yo, as an Android user, you give Android users a bad name.  Thanks. I would say the same to you.  >The world has moved on from the SD card and the headphone jack.  No, it hasn't and it shouldn't yet. If something needs to be replaced, then it's only because an alternative which does exactly the same more effectively is available, and that simply isn't the case with the headphone jack and SD card.  Furthermore, the headphone jack(AUX jack) is literally the universal standard for transporting audio signals, so it's going nowhere fast. The world isn't even close to moving on from it, as nothing so far is capable of replacing it.  The SD card is probably the one feature that most electronic devices in the world share, as a result of its incredibly usefulness. Imagine not having to be ever worried about storage, but without paying a fortune for that luxury. Imagine being able to easily plug-and-play massive amounts of data between vastly different devices. There is nothing in the world right now that is even remotely as universally useful.  &#x200B;  &#x200B;",
        "The same jokes get old after using them for the 10000th time. They're also really ignorant and a lot of people believe them, as evident from the userbase that buys these Apple products that offer little to no features or options for the consumer.",
        "[I think this is what you're looking for.](https://www.youtube.com/watch?v=dQw4w9WgXcQ)",
        "bro it's not 2010 anymore. Stop arguing about apple vs android fans. "
    ],
    "2020_Nov": [
        "Jesus Christ. This is embarrassing.",
        "Underwhelmed.",
        "Aaand it just concluded. Tbh I was expecting a Macbook touch, but man this new M1 chip looks like a huge step to the industry. Again, well done apple team.",
        "That's...it?",
        "$100 less with soldered ram lmao what a joke",
        "aCTive COoLIng SySTeM. Just say it isn't fanless smh",
        "Oooh shes cute",
        "> Best in class security.  Worst in class repair it yourself-ability?  LOL. People gonna be MAAAAD.",
        "No price cuts...  Apple, your greed is showing",
        "Kinda funny that for 90% of their customers who use their devices as reddit/Facebook machines, none of what they're saying actual matters. And people still can't wait to throw their money at them.   Marketing is truly the most important and valuable part of their business.",
        "Yo wtf who the fuck wants a mac mini",
        "Kinda disappointed",
        "$699 for that is definitely not worth it. I'd pay like... $200-300 range.",
        "Eww touchbar",
        "Mac mini who gives a crap",
        "they talk a lot about battery lifes but it's all shite,, i have a macbook pro 2019 it barely gives me  3 hours....",
        "You had one job and it was to put 5g on your laptops and you fucked up.   Also this marketing reminds me hard of the Apple card.",
        "Bringing back \"I'm a PC\" for this is cringe as fuuuuuuck. I fucking hate Apple anymore.",
        "Wow they are really trying to push the diversity angle...",
        "[gelöscht]",
        "Oh shit, she’s not white!  Oh... white shoes. Never mind.",
        "Many of you here won’t understand this- but this is what sets Apple apart and makes it impossible to compete with them.",
        "Apple: The king of providing vague asf stats.  Apple fanbase: The king of lapping up these vague-asf stats.",
        "BOOOOORING",
        "'fastest integrated graphics'  So? How does it stack up against dedicated GPUs?",
        "BRING BACK THE BUTTERFLY KEYBOARD!",
        "No fan? The hell they thinking.",
        "Wth who asked for a mini",
        "I’m sorry but who wants a Mac Mini? 💀😭",
        "LETS GO APPLE HOLY SHIT",
        "Mac Mini = PS5/XBSX/RYZEN/AMPERE KILLER. OMG So Small Such Power",
        "WTF ARE THEY SAYING LMAO. YOU CAN LITERALLY GET 10x PERFORMANCE FROM A WINDOWS DESKTOP THAN A STUPID ASS MAC MINI WITH THE SAME MONEY LOL",
        "That was terrible",
        "LOL like anyone still uses Final Cut Pro",
        "So basically they turned the Macbook into an ipad pro with a chip upgrade.   Pass for everyone that isn't a ipad pro fan.",
        "Why does the MacBook Pro need fans?",
        "Razer book 13 > Mac Book Pro",
        "Boring AF.",
        "Now you can upgrade even less than before! And it's more expensive! Rejoice!",
        "Sus",
        "What an L",
        "[entfernt]",
        "does anyone actually buy pre-made desktop PCs?",
        "she kinda bad tho. gimmie 😈",
        "\"World's fastest CPU\" lol yeah right. Bet it's not even half as fast as AMDs Zen3.  Edit: Well it looks like we have the first cross platform benchmark, and yup, just as I suggested, about half as fast as Zen2.. Zen3 is about 30% faster than that. So yeah M1 is actually even worse than I thought. Apple should have went AMD. M1 is garbage. https://hexus.net/tech/news/cpu/146878-apple-m1-cinebench-r23-benchmark-scores-revealed/",
        "[gelöscht]",
        "Engineers have left the chat. Thanks to lousy Mac support for engineering software",
        "Gotta grab that virtue signally cash",
        "Thank Godzilla I bought the MacBook Pro 16 when I did and didn't wait.  Ain't nothing here for me yet in Apple Silicon—just as I've been expecting and saying.",
        "[gelöscht]",
        "cringe",
        "I hate their presentation style...",
        "[gelöscht]",
        "creepy",
        "gaming specs? IF NONE GARBAGEEEEEEEEEEE",
        "[gelöscht]",
        "Did he get COVID?",
        "[gelöscht]",
        "Here it comes",
        "just one product wtf?",
        "Very pleased I didn't wait for this!",
        "I'm skeptical... if the M1 chips were supposedly so fast and good why would they put it in their most budget PC?",
        "That io is honestly shit...",
        "iMac here we go",
        "[gelöscht]",
        "BIGG THICCY",
        "[gelöscht]",
        "Fuck",
        "Daddy cringe",
        "Somebody is insecure...",
        "Nanometre, not “nanometer”. Does Apple not know the difference between them?",
        "RIP Zen 3?",
        "pages and keynote!! I’m sold! /s",
        "[gelöscht]",
        "[gelöscht]",
        "Did say the resolution of the laptop? And still no touchscreen?",
        "The Memebar is still there, rip actual Pro users.",
        "[entfernt]",
        "Okay.",
        "[gelöscht]",
        "Why no touch screen?",
        "So cringe",
        "Gotta try and get in with the kids even if it isnt true or smart to do...",
        "Speed",
        "LMAO XD XD 111111",
        "How else are you going to sell the dummies on marketing speak if you give them real numbers that actually mean something rather than trying to trick them into believing complete lies?",
        "Simp",
        "Not that I know",
        "Don’t say that word, you’ll be downvoted",
        "Prepare to be disappointed",
        "You didn’t call shit. This isn’t a Mac mini only reveal and anyone here would’ve told you the Mini was obvious because these were the devkits sent out months ago to developers",
        "Um... they're both correct.  >The nanometre (international spelling as used by the International Bureau of Weights and Measures; SI symbol: nm) or nanometer (American spelling) is a unit of length in the metric system, equal to one billionth (short scale) of a metre (0.000000001 m).",
        "Both spellings are correct.",
        "I literally work in the industry it’s targeted towards... I’m a professional editor. Literally no one I’ve ever met or worked with still uses Final Cut Pro.",
        "Yep you are one of the kids I was talking about.",
        "not sure if s/",
        "I’m ridiculing your childish expressions. Other way around champ  Pretty weak response  She just said improved camera quality soooo",
        "Apple are much more successful than AMD. Fancy that.",
        "Meter/metre is an SI unit and can be spelled either way."
    ],
    "2018_Oct": [
        "[gelöscht]",
        "[gelöscht]",
        "Who goes to these sessions? My fk grandma has more apple products than I do ",
        "Sorry, but having an artist perform at an Apple ***tech*** event is lame. I don't give a fuck how popular she may be to some people, it was such a downer.",
        "But Surface Pro does all that too?",
        "[entfernt]",
        "So why the hell can I buy a new cutting edge iPad Pro starting at $800 with actually decent looking design, but for an iPhone I either have to settle for a subpar XR that takes features away or spend at least $1000 for what is probably the worst smartphone design trend ever (the notch)?  EDIT - God forbid I want the iPhone to look as nice as the new iPad Pros look, can't criticize the almighty notch on r/Apple!",
        "Underwhelming. Apple should stop doing these events unless there’s a big upgrade or change ",
        "[gelöscht]",
        "Cool, now you can animate your poster. Last time I checked my posters on the wall don't move. How utterly useless ",
        "Xbox One S can barely do 720p resolution on some games lol",
        "No Lie, guys.",
        "They brought that older lady out just to diversify (by gender, at least. Stage is still white as fuck) the presentation.  She said three sentences.",
        "Couldn't they get gaga to sing shallow or something 👀",
        "core y lol what a joke",
        "So $1400 bucks.  Also recycled Atoms lol",
        "[gelöscht]",
        "[gelöscht]",
        "This is such a huge let down, like the past 4-5 years of apple keynotes.  ",
        "[gelöscht]",
        "Apple: Welcome to Dongletown where you get to be on EGPU lifesupport, lol.  This computer is hot, though. Buying it for my travel computer unless there's a better MacBook update today.",
        "[gelöscht]",
        "Didn't the last pro have a retina?  why would this one have an LCD?",
        "no audio jack?",
        "Lol I really thought they were going to do something good with the mac mini ",
        "I just bought a 2016 MacBook Air from the Apple Store. What can I do to get it exchanged or replaced?",
        "No iPads?",
        "This guy is a goon ",
        "Lol why don’t they show something like pubgm instead of that kid game",
        "Pretty sure the iPad Pro is not for watching movies. ",
        "[gelöscht]",
        "Now if only USB-C would actually become usable and standard outside of Apple.",
        "Wait, ew, they're stylizing it as \"Mac mini\"?  Gross.",
        "[gelöscht]",
        "No USB-C in the Mac Mini? Or is thunderbolt compatible?",
        "[gelöscht]",
        "Faster than 92% but run iOS ..remove the bottleneck os ",
        "What an ugly shirt from the mac mini guy",
        "[gelöscht]",
        "[gelöscht]",
        "Confirmed: you ain’t funny ",
        "Every year, someone will say that this year’s product updates are underwhelming and won’t be upgrading. They are the same people who bought last year’s release.  They forget that there are people who have had the same item for 5 years and are looking to upgrade.",
        "Mate it's a desktop just plug an external into it lmao are you serious",
        "It's significantly lighter.  And the Pro at that price won't have Touch ID.  Nice try.",
        "In our dreams my dude",
        "$899 if you want 10gb Ethernet.   The same Ethernet my $60 motherboard had in 2015. ",
        "I’ve never not been able to get a walk in within 3 hours, or an appointment within a week. I don’t think that’s too unreasonable. ",
        "I don’t think so. I think the new pencil has a different connector to charge its battery and the new iPad has a new connector on the side to do that.",
        "Revolutionary! Wireless charging!!! Real trailblazers!",
        "[gelöscht]",
        "Who cares",
        "Yup.  That's a great price for people who need something cheaper and don't have an iPhone X device yet.",
        "Yeah. Why the heck apple invited here? Doesn’t suit apple image. ",
        "[gelöscht]",
        "nope fuck this company is stupid",
        "Most people don't need or want the best",
        "So talk about it in the quarterly report which is in a couple of days anyway",
        "Narrator: he couldn’t ",
        "That’s about the only thing it’s got going for it but alright.",
        "LOL.  \"It's super small, bruh... I would pay any price apple told me to pay!\"",
        "Good lord my sides!",
        "Uh oh trigger alert ",
        "[gelöscht]",
        "Come on. There will might be a dongle for that. This isn’t fair for the ipad pro and ipad 2018. ",
        "If you want an SSD, you'll have to pay money. Sorry kid.",
        "Then I'm just plain not buying them. lol  Edit: Downvoted for not saying I will not buy a product that I physically cannot wear. This sub sometimes. lol",
        "[gelöscht]",
        "Of course there are cheap options, but some people want to stick with Apple certified dongles and doodads so for them, 9 bucks isn't too bad at all. ",
        "Are you ok? Are you ignoring it’s not the same size factor? Has almost no ports and look like shit?   You can go back to r/technology now "
    ]
}