{
    "2020_Nov_Pre": [
        "[gelöscht]",
        "Way more excited for this than the iPhone 12 event",
        "Anybody else surprised with the lack of leaks this time? Apple has surely kept a tight lid this time around, which makes this event even more exciting!",
        "What are the chances of the new 13 inch MacBook being released the same day tomorrow? It sucks that I've been waiting months for one. And if not then how long is the time between announcement and release?",
        "I remember the Intel transition so well. It was so hyped and hotly anticipated. Rightly so.   Looking back though, it feels like today has the potential to be a more significant event for the industry.   2005 was a consolidation. In 2004, Mac (and broadly by extension PowerPC) had less than 3% market share. They were joining the 95% of other computers on Intel.   Apple Silicon is a departure. The creation of what might be a mass-market, alternative architecture. Macs still haven’t cracked 10% market share. But if Apple can offer same performance, cheaper, with 150% battery life, for the first time since the emergence of the wintel monopoly, there is a small chance of real disruption.",
        "A new TV would be great... what exactly are the potential new features it would have?",
        "Apple Live Thread Bingo time:   -\tWAIT?! Is that it?  -\tWhat about <Rumored thing>?! -\tApple is such shit -\tJobs rolling in his grave -\tHey that’s pretty cool -\tApple is so fucking stupid. Still not releasing a thing only I and a few people on a niche subreddit want -\tSo much cringe -\t<Very brave comment about some very brave topical issue> -\tYawn -\tI’m just getting a Dell fuck this -\tActual informed comment -\tDAE No ports on Macbook? Please clap. -\tI have no use for this product and therefore it is fucking useless",
        "Considering the amount of remote working/learning, Apple would cave and add the 1080p webcam",
        "Same here. Largely because we don’t really know what to expect.",
        "Maybe the wild speculations from the last few events was Apple's method to catch the sources of the leaks.",
        "If they were serious about Apple Arcade they could throw some money around and get high profile exclusives and turn the Apple TV into a console that balances gameplay and content streaming.  Unfortunately, I don’t think they’re serious about Apple Arcade.",
        "Pretty sure it takes them over a year to design and source this type of stuff."
    ],
    "2019_Mar_Pre": [
        "If they don’t announce AirPower tomorrow I will eat the money I set aside for it.",
        "The US changed their clocks a few weeks ago but Europe doesn’t change them until this coming weekend. That means that while Apple events normally start at 19:00 in most of Europe, **today’s event starts at 18:00** and what is written in the OP is incorrect. (Not sure about the rest of the world.)  I realised this last night and wanted to make sure that others who are used to the events taking place at a certain time were aware.",
        "I had no clue about a gaming service I wonder what they have up their sleeve",
        "Whatever service they launch, I hope that it will be offered outside the US. So many times other countries get the short straw in this respect. ",
        "Anyone else feel like they might pull an original iPhone type announcement today?   “...A music streaming service. A TV & Movie streaming service. A game streaming service... are you getting it? These are not three separate services, this is one service, and we are calling it...”",
        "Everything I’ve read has said that Tim Cook has been pushing for Apple to become a services company for **years.**  But we’re not just talking about offering a service: rather, Apple is actually producing their own content.   Making their own TV shows and movies is a risky move. It has literally cost the company **BILLIONS** of dollars.  And they’re playable on any ol’ smart tv.  That’s a big shift coming from the company that cares so much about the user experience it makes its own hardware and software. Now you can just get their stuff anywhere, huh?  If this initiative doesn’t pay off, I think it’s safe to say we will see a major leadership change at Apple in the next three or four years.",
        "I’m preparing for the usual Canadian disappointment. ",
        "I appreciate that you guys covered most of the time zones but it would be great if there was GMT as well. For most people, that is the only one they need irrespective of country.",
        "[gelöscht]",
        "I'm weirdly unexcited. There is a solid chance that 0 of the purported new services will be available in my country. There still is no Apple News here, I'd be damned if they were allowed to offer HBO (we're a Sky country) as a subscription, and paying €10 for TV shows that \"aren't so mean\" is not an attractive supposition whatsoever. ",
        "This sounds like the most unexciting apple event to me. ",
        "They’re totally announcing AirPower. Comes with a free copy of Half Life 3",
        "*Do you mean eat or yeet?*",
        "[gelöscht]",
        "I confirm! The italian apple site says to follow the live from 18.00! ",
        "It’s like Game Center. Only now you pay for it. ",
        "If they’re introducing a gaming service, Apple desperately needs to introduce their own hardware controller.  I know it sounds silly, but Apple would be taken more seriously for games if they offered their own controller that seamlessly connected to iOS devices and Apple TV as easily as AirPods do.  No one wants to hunt down a MFI controller. I don’t know anyone — not one damn person — that owns one. Most people probably don’t even know that they’re offered by third-parties.  And besides, on consoles, no one likes cheap off-brand controllers anyway.  Until an official, bone fide Apple controller is introduced, the company will remain an afterthought in gaming — a mobile gaming company only. Yes, there is money in that. But you know as well as I do they’re going to show off “console-level” graphics and whatever else tomorrow, and it’ll be worthless if it doesn’t have an official console-level controller to support them.",
        "\"... iService.\"",
        "The thing is, Apple is a cash generator. They produce billions and billions of cash each month and need to find ways to invest it that will complement their existing businesses. They were the first US company in history to be valued at one trillion dollars. They can afford to throw $10 billion in a new venture and see if it pays off. They lose very little if it doesn't.  Tim Cook's genius has always been in making Apple's hardware supply chain lean and profitable. He's unlikely to be fired no matter what happens with Apple media.",
        "[gelöscht]",
        "I don't know if this is as much Tim's idea or actually just the natural progression of Apple. Their products are in every household, they've reached critical mass. The next sensible step is to acquire recurring revenue with services for those products.",
        "It's exciting because nobody knows what they're going to introduce.  September event you already know it's going to be a new iPhone.  WWDC it'll be some new software feature.  Oftentimes it'd be new hardware announced today, but they already did that 3 days in a row last week.  Nobody knows what will be introduced or how cool it will be.   Will it be awesome, or will look like a dud from the get-go?  Of course, all that doesn't mean it's exciting to you.  Just giving some perspective as to why it may be exciting to others.",
        "HL3 should be a mac exclusive. See pc gamers scream confusingly. ",
        "Yes.",
        "Ah so this is why they were so strict with Steam Link...makes sense now",
        "If they make it anything like their Apple TV remote, then please no. ",
        "Especially because the content that is being made by Apple is subject to scrutiny.  We’re talking about Apple becoming a movie studio.  What if their shows are bad? If the acting sucks? If people don’t like it, it’s not like software where you can release a 2.0 update and fix it down the line.  This is totally uncharted territory for Apple. You can’t throw more engineers on a bad movie to fix it. Instead, it bombs and you take the loss to your pocketbook and your reputation.",
        "*Yes what?*",
        "Exactly  \"You want to play games from other consoles you already purchased? Well now you can play every game you haven't purchased, and still pay for it!\"  *grammar",
        "Yes sir.",
        "/r/InclusiveOr",
        "*valve sweats nervously*"
    ],
    "2018_Sept_Pre": [
        "Can't wait to have my latest dose of 'Good Morning!' xD",
        "I’m just happy to be here guys",
        "I could really do with a successor to the SE.",
        "Will the Mojave release date be announced tommorow?",
        "Here’s to hoping the names for the iPhone’s are not as bad as the rumors have reported",
        "Personally I’m hoping for a $199 iPhone that comes with Android, two headphone jacks, and a USB-A port that will make /r/technology fall in love with Apple ",
        "I’ll raise my glass for ProMotion 🍻",
        "These rumored names.  Say it aloud, the iPhone 10 are, the iPhone 10 see, the iPhone 10 ess max.  Please do not be the names.",
        "Have to stay up til 2am to watch but worth!! (In Tokyo right now)",
        "Bring on the hype",
        "my iPhone 6 is ready to be buried for a space grey iPhone Xs.. iOS 12 helped a little but it feels so slow even compared to my friend’s 6S. The 1gb ram just kills it.  ",
        "It’s like Christmas Eve. Happy Apple Xsmax — I mean, Xmas! ",
        "Shouldn't this be Xs?  >3 iPhones: iPhone Xr, iPhone **Xc**, iPhone Xs Max  &#x200B;",
        "Random thought — seems most have totally forgotten about rumors of Apple coming out with a pair of over-ear headphones. I doubt anything like that is coming tomorrow, but interesting nevertheless. ",
        "I’m all in on whatever the name of the new flagship model is. I’ve sold my i8+ (got 85% of RRP back!) and I sure hope whatever is announced in ~12 hours is worth having to use an iPhone 6 16GB until the new phones ship...",
        "Good Morning! 😂",
        "[gelöscht]",
        "Will be in Europe for two weeks do you think it’s worth buying the phone or watch in Europe? ",
        "I’m just happy to be alive",
        "Amen. ",
        "Having a very limited amount of money, I’m really hopeful of a new SE because of the lower price, and the ergonomics are great. EverythingApplePro made a video a couple months ago about a potential SE 2 with a glass back and an all-screen front. Fingers crossed!",
        "Don’t forget the removable battery and SD card!",
        "Really don’t get why they’d call it the r - it’s not higher resolution or anything, if anything it’s worse than the others ",
        "Ouch! Expect to be up until 4! ",
        "Been using my iPhone 6 Plus for the last 4 years. So pumped for the event!!",
        "I really hope they don’t go with “Max” as the name.",
        "[Mine too](https://media.giphy.com/media/l2R0dP8CQgpDHHrbO/giphy.gif)",
        "I really know the exact intonation off by heart at this point too 😂",
        "Much much more expensive to buy in Europe ",
        "Typing this from an SE. Can confirm. ",
        "You can have a new SE just by upgrading to OS12. Your welcome.",
        "and optical drive",
        "It better have atleast 8gb ram lol ",
        "And 3 SIM card trays.",
        "People have been saying it’s because the letter R comes before S in the alphabet and the R has less performance. Not one of the best ideas. ",
        "I hope they bring it to the whole product line so I can pickup a MacMax and a MaxiPad.",
        "Optical drive??? Only if it also comes with a 3.5” floppy drive too. I need to work on my spreadsheets from 1992 dammit!",
        "Only a slim amount, but even when disregarding taxes the currency exchange is unfavorable."
    ],
    "2020_Nov": [
        "It's okay apple you can say that it's still a 720p camera",
        "Who's using a Mac Mini with a $6,000 display?!",
        "Who tf has a Mac mini AND a pro XDR?",
        "Tim Cook: Psych we got you good, we using AMD chips instead.",
        "Wait, that's not a Mac! Lisa Simpson uses Mapple products.",
        "Mac mini with $5000 apple display what",
        "Who's idea was it to show a game running at 15 FPS? yikes",
        "3x faster? They underestimate how garbage my code is.",
        "The one more thing part was just to throw shade. Kusa",
        "Wait the \"Pro\" has the same processor as the air? Just with a fan so it doesn't go thermonuclear? Bruh...",
        "That game looked 24fps lol",
        "That game looked like ass.",
        "[gelöscht]",
        "> students use it to get through college  nah, i use copious amounts of alcohol",
        "I love Apple’s keynote graphs. See this curve with no scale on the Y or X axis?   *WE THINK YOU’RE GONNA LOVE IT*",
        "He gonna fuck this mac",
        "I’m gonna take a hard look at the Mac Mini to replace my aging i5 MacBook Pro to go along with my iPad Pro.",
        "[gelöscht]",
        "That’s a lot of words to say 720p camera",
        "LMAO They brought the PC guy back",
        "what the fuck was that",
        "##And you can run 3 tabs of Google Chrome.",
        "Apple should've left out all of the gaming scenes. The framerate is absolutely awful.",
        "That game was not smooth lmao",
        "[gelöscht]",
        "15 FPS **CONFIRMED**",
        "New Macbook Pro Summerized  * Same thicc bezels * Same 720p camera * Same design as the last 4 years * New chip * Almost 2x battery (which is huge) * $1300 starting price",
        "##This macbook air is so new it looks just like the old one.",
        "#DoEs M1 hAvE 5G tHo?",
        "Apple's habit of showing graphs with no labeling or measurements on either axis will never stop bothering me. Might as well just say \"number go up.\"",
        "\"Latest PC laptop chip\" means absolutely nothing.",
        "\"You'll see mac mini everywhere\"  I have literally never seen a mac mini in my life, outside of a shop selling them",
        "Shruti is really good at public speaking",
        "Oh, PC. How I’ve missed you.",
        "He's blinking in morse code.  T-R-A-P-P-E-D-B-Y-C-O-O-K-S-E-N-D-H-E-L-P  I wonder what it means.",
        "WHERE ARE AIRTAGS AND AIRPODS STUDIO  I am having a childlike tantrum",
        "Yes! Classic Mac ads. lol",
        "Thats it??",
        "It’s like having a huge hotdog bun with a tiny sausage",
        "It is pretty funny. The Apple Stand holding the monitor is more expensive than the top Mac mini 🤣",
        "Cinematic."
    ],
    "2018_Oct": [
        "Waiting for that price announcement like https://imgur.com/a/NTDJE5i",
        "The NY version of Tim Cook seems so much more hype. What are they feeding him on the east coast?",
        "After the crowd reactions here, Apple is never going to hold another event in Cupertino. ",
        "Me when I get the new iPad Pro. “I can watch Netflix on it”",
        "that sure is a lot of glowing apple logos on those macbooks... ",
        "Tim: \"Before we stop, I have one....\"  Me: \"MORE THING!\"  Tim: \"...quick update.\"  Me: \"DAMMIT!\"",
        "Apple: \"You wanted a new Mac Pro? Just stack three Mac mini's!\"",
        "Guys you’ll be shaking worse than her if you’re the one tasked to edit photo projected to a massive ass screen",
        "Her voice is really stable for how bad her hand is shaking. ",
        "She's trembling as much as my wallet is. ",
        "CONFIRMED: Lana Del Rey is now made out of 100% recycled aluminum.",
        "Every company that's currently trying to compete in tablets: \"Fuck.\"",
        "This isn't gonna be under $1000....",
        "I know they're really trying to make the Today at Apple happen. But I've never seen people paying attention to any of the demos or classes. It's usually just someone standing up front trying to talk to people who are waiting for their genius bar appointment.",
        "I like this lady, she like watching a lecture at 2x speed!",
        "Should’ve showcased Civ VI, a much better iPad game",
        "Of course she’s nervous, it’s not your backyard BBQ presentation !",
        "Jokes on you, I don't have 32 friends.",
        "“They told us not to swear” lmao apple ",
        "continue to rest in peace AirPower. you were too courageous for your time. ",
        "Guys guys guys! iPad Pro holy fucking shit!",
        "Well the Macbook lineup just got even more confusing ",
        "[gelöscht]",
        "Tim immediately after the presentation today: \"Cancel everything, we're moving to Brooklyn\" ",
        "Poor girl 😢 she's going great!",
        "\"No lag\" she says as the scroll lags behind her lol",
        "OFFSTAGE  Lana: \"I was so nervous\"   Tim: \"No I'm the one thats nervous, you were great\"  Seriously, this is one of the best keynotes. Can't even handle it.",
        "All Today at Apple sessions are made with 100% Recycled Aluminum",
        "These prices are awful. Checked the store and the entry level prices are bad then going up to the midrange is absurd. I5 in the mac mini is $1099. 256 GB in the Air is $1399. Pencil costs more. Keyboard costs more. ",
        "Press F to pay respects to:  * Airpods 2  * AirPower  * Mac Pro  * iPad headphone jack  * iPad Mini (which they talked about repeatedly but didn't update????)  * Regular iMac  * Pro display",
        "The amount of cheering for Angela coming on stage to talk about Apple Stores pretty much shows you just how many Apple employees are in the room. ",
        "All of our team members are made of 100% recycled aluminum ",
        "Y'all are acting as though you wouldn't be shaking if your boss was like \"You're going to be on stage in front of 2,000 people to give a presentation in a month.\"",
        "Haha the Guardian's live thread on this is pretty funny.   >Now we get the standard bit where [Apple](https://www.theguardian.com/technology/apple) pretends that people use Augmented Reality. The iPad is good for Augmented Reality, apparently.  &#x200B;  &#x200B;",
        "I swear to god, if, at the end of the performance, she doesn't pull her hair aside to reveal the new AirPods, I'm going to fucking scream.  Then go online to finally buy the current pair in despair.",
        "$1200 USD for 128gb 😂😂😂😂 y'all fucked ",
        "She's very nervous. Breathe in, breathe out.",
        "[gelöscht]",
        "after the concert, “and to enjoy Lana del Rey’s music on the go here are our all new airpod 2”",
        "That new iPad Pro is so orgasmic... **except they got rid of the goddamn headphone jack. On a Pro device**. Which musicians are supposed to use to **make music** because it’s supposedly targeting and inspiring “creative types”. ",
        "128 SSD.  I'm dying.",
        "$1199!?!?!?!?! IS THIS A JOKE LOL",
        "Bacon Egg & Cheese w/ an Arizona iced tea.",
        "Yea, they were acknowledging people using older MacBooks. Did you not notice the 2009 plastic MacBook at the end?",
        "They were doing so well.. then defeated the purpose of the air "
    ]
}